Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/primary_and_post_primary_education/attendance_and_discipline_in_schools/school_discipline.html.txt.tmx
Source language: en
Languages: ga

source: The Education (Welfare) Act 2000 sets out the law in relation to discipline in State primary and post-primary schools
ga: Leagann an tAcht Oideachais (Leas) 2000 amach an dlí in Éirinn maidir le smacht sna bunscoileanna agus iarbhunscoileanna Stáit

source: Under the Act the board of management of the school is obliged to draw up a code of behaviour for students stating the disciplinary rules and procedures
ga: Faoin Acht, tá dualgas ar bhord bainistíochta na scoile cód iompraíochta a leagan amach ag sonrú na rialacha agus nósanna imeachta smachta

source: Codes are drawn up with input from teachers, parents and the educational welfare officer
ga: Leagtar cóid amach le hionchur na múinteoirí, na dtuismitheoirí agus an oifigigh leasa oideachais

source: (Educational welfare officers work for the Child and Family Agency and they help co-ordinate all policies concerning both attendance and broader educational welfare.)
ga: (Oibríonn na hoifigigh leasa oideachais leis an Ghníomhaireacht um Leanaí agus an Teaghlach agus cuidíonn siad le comhordú na bpolasaithe ar fad maidir le tinreamh agus leas oideachais níos leithne araon)

source: A code of behaviour must lay down the:
ga: Caithfidh cód iompraíochta a leagan síos:

source: • Types of behaviour by the student that may need disciplinary measures
ga: • Na cineálacha iompraíochta ón mac léinn a mbeadh bearta smachta riachtanach maidir leo

source: • Nature of the disciplinary measures to be carried out
ga: • Cineál na mbeart smachta le comhlíonadh

source: • Procedures to be followed before a student is suspended or expelled
ga: • Nósanna imeachta le leanúint sula gcuirtear mac léinn ar fionraí nó é/í a dhíbirt

source: • Grounds for lifting a suspension
ga: • Cúiseanna le fionraí a chur i leataobh

source: There are Guidelines for Schools on Developing a Code of Behaviour (pdf) and information about the Guidelines on the Agency's website on the Agency's website
ga: Tá tuilleadh eolais faoi na Treoirlínte i gComhair Scoileanna ar Chód Íompar a Fhorbairt (pdf) agus na Treoirlínte ar fáil ar an suíomh gréasáin an Ghníomhaireacht um Leanaí agus an Teaghlach

source: When a child is becoming a student at the school, the principal must give a copy of the code to the parents and may require that the parents agree to make all reasonable efforts to ensure that the child complies with the code
ga: Nuair atá leanbh ag tosú mar mhac léinn sa scoil, caithfidh an príomhoide cóip den chód a thabhairt do na tuismitheoirí agus d'fhéadfadh riachtanas a bheith ar na tuismitheoirí aontú gach iarracht a dhéanamh a chinntiú go gcloíonn an leanbh leis an gcód

source: Department of Education and Skills guidelines recommend that the prevention of bullying should be a fundamental part of a written code of behaviour and discipline in all schools
ga: Molann treoirlínte na Roinne Oideachais agus Scileanna gur chóir go mbeadh cosc ar bhulaíocht mar pháirt lárnach de chód scríofa iompraíochta agus smachta i ngach scoil

source: Schools have considerable independence in the area of discipline
ga: Tá mórán neamhspleáchais ag scoileanna i réimse na smachta

source: However, they must use fair procedures
ga: Caithfidh siad, áfach, nósanna imeachta atá cóir a úsáid

source: This includes hearing the student's case
ga: Cuimsíonn sé seo éisteacht le cás an mhic léinn

source: Most schools already have a code of behaviour that sets out how students will punished for breaching it
ga: Tá cód iompraíochta ag an gcuid is mó de scoileanna anois a leagann amach conas mar a chuirtear pionós ar mhic léinn nuair a sháraítear an cód

source: It is assumed that parents agree to the punishments set out in the code if they are told about the code when their child starts school
ga: Glactar leis go n-aontaíonn na tuismitheoirí leis na pionóis leagtha amach sa chód má tá an méid seo ráite leo nuair a thosaíonn an leanbh ar scoil

source: As a result, if the punishment is detention, the parents or student cannot claim that the student has been falsely imprisoned
ga: Dá thoradh seo, más coinneáil istigh atá mar phionós, ní féidir leis na tuismitheoirí ná an mac léinn éileamh go ndearnadh iad a phríosúnú go héagórach

source: If there has been serious misbehaviour, the school may decide to suspend a student
ga: Dá mbeadh an mí-iompar go trom, feadfadh an scoil cinneadh ar fhionraíocht an dhalta

source: This decision is made only after all other disciplinary measures have been tried
ga: Déanfar an cinneadh nuair a tabharfar faoi gach eile beart smachta

source: The school will notify the parents of the suspension
ga: Tabhairfaidh an scoil fógra do na thuismitheoirí

source: The parents may appeal this decision to the board of management and as a last resort to the Department of Education and Skills
ga: Is féidir le tuismitheoir achomharc a dhéanamh leis an mbord bainistíochta agus mar rogha dheiridh leis an Roinn Oideachais agus agus Scileanna

source: Before a student is expelled, the educational welfare officer must be told
ga: Sula ndéantar mac léinn a dhíbirt, caithfear an méid sin a insint don oifigeach leasa oideachais

source: The educational welfare officer may then try to find a solution
ga: D'fhéadfadh an t-oifigeach leasa oideachais ansin iarracht a dhéanamh teacht ar réiteach

source: The student cannot be expelled until 20 days after the educational welfare officer has been notified about the case
ga: Ní féidir an mac léinn a dhíbirt go dtí 20 lá tar éis fógra a thabhairt don oifigeach leasa oideachais faoin gcás

source: Under the Education Act 1998 the Minister can, after consultations with the education partners, set out procedures whereby a parent can appeal against a decision of a teacher or other staff member to the board of management
ga: Faoin Acht Oideachais 1998, is féidir leis an Aire Oideachais agus Scileanna, tar éis comhairliú leis na comhpháirtithe oideachais, nósanna imeachta a leagan amach inar féidir le tuismitheoir achomharc a dhéanamh leis an mBord Bainistíochta

source: These procedures can also be used by parents or students who have complaints (except for expulsions)
ga: Ní féidir na nósanna imeachta seo a úsáid ach amháin maidir le tuismitheoirí nó mic léinn a bhfuil gearáin acu (lasmuigh de dhíbirtí)

source: Appeals to the Department of Education and Skills
ga: Achomhairc chuig an Roinn Oideachais agus Scileanna

source: Under Section 29 of the Education Act 1998 if a Board of Management expels a student or suspends a student or refuses to enrol a student then the parent may appeal that decision to the Secretary General of the Department of Education and Skills (DES) and the appeal will be heard by an appeals committee - see 'How to apply' below
ga: Faoi Alt 29 den Acht Oideachais 1998 má dhíbríonn bord bainistíochta mac léinn nó má chuirtear mac léinn ar fionraí nó má dhiúltaítear mac léinn a chlárú, is féidir leis an tuismitheoir ansin achomharc a dhéanamh ar an gcinneadh chuig Ard-Rúnaí na Roinne Oideachais agus Scileanna. Cloisfidh coiste achomhairc an t-achomharc

source: The procedures for the hearing of appeals must ensure that:
ga: Caithfidh na nósanna imeachta d'éisteacht na n-achomharc a chinntiú:

source: • The parties are helped to reach agreement, if possible
ga: • Go gcuidítear leis na páirtithe teacht ar chomhaontú, más féidir

source: • The appeal is conducted in the most informal way possible
ga: • Go stiúraítear an t-achomharc ar an mbealach is neamhfhoirmeálta is féidir

source: • Appeals are dealt with within 30 days, but the Secretary General may extend the time by a further 14 days
ga: • Déileáiltear le hachomhairc laistigh de 30 lá, ach is féidir leis an Ard-Rúnaí 14 lá breise a chur leis an tréimhse seo

source: If the appeals committee upholds a complaint or believes that a matter arose that needs to be remedied, it must make recommendations to the Secretary General about the action required
ga: Má sheasann an coiste achomharc le gearán nó má chreideann siad gur tháinig ceist aníos is gá a réiteach, caithfidh sé moltaí a dhéanamh chuig an Ard-Rúnaí faoin ngníomh atá ag teastáil

source: The Secretary General must give reasons for the decision of the appeals committee and, if it has made a recommendation, may give directions to the board on how to resolve the issue
ga: Caithfidh an tArd-Rúnaí cúiseanna a thabhairt le cinneadh an choiste achomharc agus, má tá moladh déanta aige, d'fhéadfaí treoracha a thabhairt don Bhord ar an mbealach is fearr leis an gceist a réiteach

source: The Child and Family Agency has the right to appeal in cases where the board of management expels a student or refuses to enrol a student
ga: Tá ceart ag an Ghníomhaireacht um Leanaí agus an Teaghlach achomharc a dhéanamh i gcásanna nuair a dhíbríonn an bord bainistíochta mac léinn nó go ndiúltaíonn siad mac léinn a chlárú

source: In cases where the parent appeals the Agency is able to make submissions to the appeals committee
ga: Tá an Ghníomhaireacht um Leanaí agus an Teaghlach ábalta aighneachtaí a dhéanamh chomh maith ar an gcoiste achomharc i gcásanna ina ndéanann tuismitheoir achomharc

source: The Education (Miscellaneous Provisions) Act 2007 (pdf), which is not yet in effect, amends Section 29 of the Education Act
ga: Leasóidh an tAcht Oideachais (Forálacha Ilghnéitheacha) 2007 (pdf), nach bhfuil curtha éifeacht fós, in Alt 29 den Acht Oideachais

source: Its provisions will require the appeals committee when they are deciding a case to take account of the educational interests of other students in the school as well as those of the student who is the subject of the appeal
ga: Cuirfidh na forálacha dualgas ar an gcoiste achomharc nuair atá cinneadh maidir le cás á dhéanamh, leasanna oideachais na mac léinn eile sa scoil a mheabhrú chomh maith leis an mac léinn atá mar ábhar an achomhairc

source: The Act will also entitle the National Council for Special Education to make submissions to an appeals committee
ga: Faoin Acht freisin beidh an Chomhairle Náisiúnta um Oideachas Speisialta i dteideal aighneacht chuig cóiste achomhairc a dhéanamh

source: Under Section 24 of the Non-Fatal Offences Against the Person Act 1997, corporal punishment of students may be a crime
ga: Faoi Alt 24 den Acht um Chionta Neamh-Mharfacha in aghaidh an Duine 1997, d'fhéadfadh gur coir a bheadh i gceist le pionós corportha ar mhic léinn

source: However, Sections 18 and 20 of the Act permit the justifiable use of force in certain circumstances, for example, self defence or defence of others
ga: Ceadaíonn Altanna 18 agus 20 den Acht, áfach, úsáid inchosanta fórsa i gcúinsí áirithe, mar shampla, féinchosaint nó daoine eile a chosaint

source: School discipline in primary schools is also regulated by the Department's Guidelines towards a Postive Policy for School Behaviour and Discipline which contains a Suggested Code of Behaviour and Discipline for National Schools and Rule 130 (as amended by Circular 7/88) of the Rules for National Schools
ga: Tá smacht scoile sna bunscoileanna rialaithe chomh maith ag Treoirlínte i dtreo Polasaí Dearfach d'Iompraíocht agus Smacht Scoile na Roinne a chuimsíonn Cód Inmholta Iompraíochta agus Smachta do Scoileanna Náisiúnta agus Riail 130 (mar a leasaíodh in Imlitir 7/88) de Rialacha na Scoileanna Náisiúnta

source: Discipline in second-level schools is also regulated by the Department's Guidelines Towards a Positive Policy for School Behaviour and Discipline
ga: Tá smacht sna scoileanna dara leibhéal rialaithe chomh maith ag Treoirlínte i dtreo Polasaí Dearfach d'Iompraíocht agus Smacht Scoile na Roinne

source: It contains a suggested code of discipline and was circulated to the management of all post-primary schools in 1991
ga: Cuimsíonn siad cód inmholta smachta agus scaipeadh iad ar bhainistíocht na scoileanna iarbhunscolaíochta i 1991

source: National Behaviour Support Service
ga: Seirbhís Náisiúnta Tacaíochta Iompraíochta

source: In 2006 a National Behaviour Support Service (NBSS) was set up to help second-level schools deal with disruptive behaviour
ga: Tá Seirbhís Náisiúnta Tacaíochta Iompraíochta bhunaithe chun cuidiú le scoileanna déileáil le hiompraíocht thoirmeascach

source: The service works with selected schools that have significant discipline problems
ga: Tá an tSeirbhís seo ar fáil do scoileanna dara leibhéal indibhidiúla a bhfuil fadhbanna smachta móra acu

source: The NBSS operates through 4 regional behaviour support teams
ga: Oibríonn an tSeirbhís seo i gceithre fhoireann tacaíochta iompraíochta ar bhonn réigiúnach

source: A team of professionals, including psychologists, works intensively with a school over a period of time to help identify the school's problems and improve student behaviour
ga: Oibríonn foireann de dhaoine gairmiúla go dian, síceolaithe ina measc, thar thréimhse ama chun cuidiú le fadhbanna na scoile a aithint agus iompraíocht na mac léinn a fheabhsú

source: In some cases the team may recommend setting up a behaviour support classroom in a school
ga: I gcásanna áirithe, d'fhéadfadh an fhoireann moladh a dhéanamh seomra ranga tacaíochta iompraíochta a bhunú sa scoil

source: Information about appeals to the Secretary General under Section 29 of the Education Act 1998 can be found on the Department of Education and Skills (DES) website including Circulars 22/02 (primary schools) and M48/01 (post-primary schools) and the DES document on appeals procedures (pdf)
ga: Tá tuilleadh eolais faoi achomhairc chuig Ard-Rúnaí faoi Alt 29 den Acht Oideachais 1998 ar an suíomh gréasáin na Roinne Oideachais agus Scileanna (ROE) lena n-áirítear Ciorcláin 22/02 (bunscoileanna) agus M48/01 (scoileanna dara-leibhéil) agus sa doiciméad ROE faoi nósanna imeachta achomhairc

source: If you are making an appeal you should complete the appeals application form and send it to the Appeals Administration Unit of the Department of Education and Skills - see 'Where to apply' below
ga: Chun achomharc a dhéanamh ba chóir duit an fhoirm iarratas a chomhlánú agus í a sheoladh don Rannóg Riaracháin Achomhairc den Roinn Oideachais agus Scileanna - féach 'Cá háit a dhéanfaidh mé iarratas' thios
